[
  {
    "id": "b80baaa9-1b0e-490c-8dd1-ab87e66e7a68",
    "relevance": 0,
    "promoted": true,
    "listed": true,
    "title": "Verificare lo stato di salute di un SSD",
    "abstract": "Se il tuo sistema si basa su dischi a stato solido controllane periodicamente lo stato di salute. Un paio di comandi CMD e pochi secondi sono sufficienti.",
    "previewPicture": "../data/placeholder.jpg",
    "body": [
      {
        "type": "p",
        "content": "Gli hard drive in genere e gli SSD nello specifico sono dotati di un sistema di monitoraggio per rilevare e segnalare comportamenti non ottimali dell'hardware che possono preannunciare un guasto. Il sistema è il <a href=\"https://en.wikipedia.org/wiki/S.M.A.R.T.\" target=\"_blank\">Self-Monitoring, Analysis and Reporting Technology</a>. La maggioranza dei guasti hardware è dovuta al graduale deterioramento dei componenti. Per questo il sistema SMART è abbastanza affidabile se preso in considerazione."
      },
      {
        "type": "p",
        "content": "Su Windows 10 è possibile leggere gli attributi monitorati dal sistema per conoscere lo stato corrente dei drive insallati. È sufficiente utilizzare i seguenti comandi tramite CMD assicurandosi che sia avviato come amministratore."
      },
      {
        "type": "code",
        "codeType": "CMD",
        "content": "wmic diskdrive get status"
      },
      {
        "type": "p",
        "content": "Questo comando ritorna \"OK\" per ogni drive rilevabile che non presenta segnali di anomali. Altri possibili stati possono essere \"BAD\", \"CAUTION\", \"UNKNOWN\". Per ottenere un dato più dettagliato sullo stato degli stessi indicatori è possibile eseguire il seguente comando."
      },
      {
        "type": "code",
        "codeType": "CMD",
        "content": "wmic /namespace:\\\\root\\wmi path MSStorageDriver_FailurePredictStatus"
      }
    ]
  },
  {
    "id": "eb72c5b1-298a-4268-a416-c7a2e82babbe",
    "relevance": 0,
    "promoted": false,
    "listed": false,
    "title": "My resume",
    "abstract": "I'm a front-end developer and designer.",
    "previewPicture": "https://avatars.githubusercontent.com/u/10224310?v=4",
    "body": [
      {
        "type": "h3",
        "content": "Education"
      },
      {
        "type": "b",
        "content": "Università degli studi di Milano Bicocca. October 2020 - Present."
      },
      {
        "type": "p",
        "content": "Bachelor of Science, Computer Science."
      },
      {
        "type": "hr"
      },
      {
        "type": "h3",
        "content": "Work"
      },
      {
        "type": "b",
        "content": "Frontend and mobile analyst, developer and tester for Info-Bit. October 2017 - Present."
      },
      {
        "type": "p",
        "content": "I'm working on the frontend and the mobile app of an hr software. I designed both codebases and I'm actively working to keep them tidy with code standards and documentation. The frontend is written in React and the app runs on React Native."
      },
      {
        "type": "p",
        "content": "I recently set up a Kanban based workflow to address short-term deadlines organically. This process allows us to focus on individual independent features without loosing the long-term vison, constantly fed by new backlog items."
      },
      {
        "type": "hr"
      },
      {
        "type": "h3",
        "content": "Skills"
      },
      {
        "type": "b",
        "content": "Programming languages"
      },
      {
        "type": "p",
        "content": "JavaScript, Java, Python, CSS, PHP."
      },
      {
        "type": "b",
        "content": "Other"
      },
      {
        "type": "p",
        "content": "React, Git."
      }
    ]
  }
]